cf/Catalogs/ContactInformationKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>ContactInformationKinds</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditInDialogOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CanChangeEditMode</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DomesticAddressOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeCountryInPresentation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mandatory</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckValidity</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProhibitInvalidEntry</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HideObsoleteAddresses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ToolTip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowMultipleValueInput</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/ContactInformationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>ContactInformationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Address</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Phone</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EmailAddress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebPage</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Fax</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ContactInformationKinds/Forms/ItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then // Return if the form for analysis is received.
		Return;
	EndIf;
	
	If Object.Predefined Then
		Items.Description.ReadOnly = True;
		Items.Parent.ReadOnly      = True;
		Items.Type.ReadOnly        = True;
		Items.ToolTip.ReadOnly     = True;
		
	Else
		// Object attribute editing prohibition subsystem handler.
		If CommonUse.SubsystemExists("StandardSubsystems.ObjectsAttributesEditProhibition") Then
			ObjectAttributeEditProhibitionModule = CommonUse.CommonModule("ObjectsAttributesEditProhibition");
			ObjectAttributeEditProhibitionModule.LockAttributes(ThisObject,, NStr("en='Allow type and group editing';ru='Разрешить редактирование типа и группы'"));
			
		Else
			Items.Parent.ReadOnly = True;
			Items.Type.ReadOnly = True;
			
		EndIf;
	EndIf;
	
	ParentRef = Object.Parent;
	CurrentLevel = ?(ParentRef.IsEmpty(), 0, ParentRef.Level() );
	
	Items.AllowMultipleValueInput.Enabled = ?(CurrentLevel = 1, False, True);
	
	If Not Object.CanChangeEditMode Then
		Items.EditInDialogOnly.Enabled					= False;
		Items.AllowMultipleValueInput.Enabled			= False;
		Items.DescriptionSettingsByTypeGroup.Enabled	= False;
	EndIf;
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	ChangeRepresentationOnTypeChange();

EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If Not CurrentObject.CheckFilling() Then
		Cancel = True;
	EndIf;
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	If Not CurrentObject.Predefined Then
		// Object attribute editing prohibition subsystem handler.
		If CommonUse.SubsystemExists("StandardSubsystems.ObjectsAttributesEditProhibition") Then
			ObjectAttributeEditProhibitionModule = CommonUse.CommonModule("ObjectsAttributesEditProhibition");
			ObjectAttributeEditProhibitionModule.LockAttributes(ThisObject);
		EndIf;
	EndIf;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, AttributesToCheck)
	
	AttributesToCheck.Clear();
	
EndProcedure

#EndRegion

#Region FormHeaderItemEventHandlers

&AtClient
Procedure TypeOnChange(Item)
	
	ChangeAttributesOnTypeChange();
	ChangeRepresentationOnTypeChange();
	
EndProcedure

&AtClient
Procedure ClearType(Item, StandardProcessing)
	
	StandardProcessing = False;
	
EndProcedure

&AtClient
Procedure DomesticAddressOnlyOnChange(Item)
	
	ChangeAttributesOnChangeHomeCountryOnly();
	ChangeRepresentationOnChangeHomeCountryOnly();
	
EndProcedure

&AtClient
Procedure ProhibitInvalidEntryOnChange(Item)
	
	ChangeAttributesOnChangeCheckValidity();
	
EndProcedure

&AtClient
Procedure CheckValidityOnChange(Item)
	
	ChangeAttributesOnChangeCheckValidity();
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Attachable_AllowObjectAttributeEdit(Command)
	
	If Not Object.Predefined Then
		If CommonUseClient.SubsystemExists("StandardSubsystems.ObjectsAttributesEditProhibition") Then
			ObjectAttributeEditProhibitionClientModule = CommonUseClient.CommonModule("ObjectsAttributesEditProhibitionClient");
			ObjectAttributeEditProhibitionClientModule.AuthorizeObjectDetailsEditing(ThisObject);
		EndIf;
	EndIf;
	
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtClient
Procedure ChangeRepresentationOnTypeChange()
	
	If Object.Type = PredefinedValue("Enum.ContactInformationTypes.Address") Then
		Items.Checks.CurrentPage = Items.Checks.ChildItems.Address;
		Items.EditInDialogOnly.Enabled = Object.CanChangeEditMode;
		
		ChangeRepresentationOnChangeHomeCountryOnly();
		
	ElsIf Object.Type = PredefinedValue("Enum.ContactInformationTypes.EmailAddress") Then
		Items.Checks.CurrentPage = Items.Checks.ChildItems.EmailAddress;
		Items.EditInDialogOnly.Enabled = False;
		
	ElsIf Object.Type = PredefinedValue("Enum.ContactInformationTypes.Skype") Then
		Items.Checks.CurrentPage = Items.Checks.ChildItems.Skype;
		Items.EditInDialogOnly.Enabled = False;
		Items.AllowMultipleValueInput.Enabled = True;
		
	ElsIf Object.Type = PredefinedValue("Enum.ContactInformationTypes.Phone")
		Or Object.Type = PredefinedValue("Enum.ContactInformationTypes.Fax") Then
		Items.Checks.CurrentPage = Items.Checks.ChildItems.Another;
		Items.EditInDialogOnly.Enabled = Object.CanChangeEditMode;
		
	Else
		Items.Checks.CurrentPage = Items.Checks.ChildItems.Another;
		Items.EditInDialogOnly.Enabled = False;
	EndIf;
	
EndProcedure

&AtClient
Procedure ChangeAttributesOnTypeChange()
	If Object.Type = PredefinedValue("Enum.ContactInformationTypes.Address") Then
		ChangeAttributesOnChangeHomeCountryOnly();
		
	ElsIf Object.Type = PredefinedValue("Enum.ContactInformationTypes.EmailAddress") Then
		Object.EditInDialogOnly = False;
		ChangeAttributesOnChangeCheckValidity();
		
	ElsIf Object.Type = PredefinedValue("Enum.ContactInformationTypes.Phone")
		Or Object.Type = PredefinedValue("Enum.ContactInformationTypes.Fax") Then
		// No changes
		
	Else
		Object.EditInDialogOnly = False;

	EndIf;
	
EndProcedure

&AtClient
Procedure ChangeRepresentationOnChangeHomeCountryOnly()
	
	Items.ProhibitInvalidEntry.Enabled   = Object.DomesticAddressOnly;
	Items.HideObsoleteAddresses.Enabled  = Object.DomesticAddressOnly;
	
EndProcedure

&AtClient
Procedure ChangeAttributesOnChangeHomeCountryOnly()
	
	If Not Object.DomesticAddressOnly Then
		Object.CheckValidity			= False;
		Object.HideObsoleteAddresses	= False;
	EndIf;
	
	ChangeAttributesOnChangeCheckValidity();
	
EndProcedure

&AtClient
Procedure ChangeAttributesOnChangeCheckValidity()
	
	Object.ProhibitInvalidEntry = Object.CheckValidity;
	
EndProcedure

#EndRegion
